{
  "Amar Gambit": "The Amar Opening (also known as Paris Opening, Drunken Knight Opening, or Ammonia Opening) is a chess opening defined by the move:\n1. Nh3\nThis opening is sometimes known as the Ammonia Opening, since NH3 is the chemical formula for ammonia. The Parisian amateur Charles Amar played it in the 1930s. It was probably named by Savielly Tartakower who used both names for this opening, although the chess author Tim Harding has jokingly suggested that \"Amar\" is an acronym for \"Absolutely mad and ridiculous\" (Winter 1996, p. 89).\nSince 1.Nh3 is considered an irregular opening, it is classified under the A00 code in the Encyclopaedia of Chess Openings.",
  "Amsterdam Attack": "The Van't Kruijs Opening (Dutch pronunciation: [vɑn ət ˈkrœys]) is a chess opening defined by the move:\n1. e3\nIt is named after the Amsterdam player Maarten van 't Kruijs (1813–85) who won the sixth Dutch championship in 1878. As this opening move is rarely played, it is considered an irregular opening, and thus it is classified under the A00 code in the Encyclopaedia of Chess Openings (ECO).\nThe opening 1.e3 is not popular according to ChessBase; it ranks eleventh in popularity out of the twenty possible first moves. It releases the king's bishop, and makes a modest claim of the centre, but the move is somewhat passive. The queen's bishop's development is somewhat hindered by the pawn on e3, and White usually wants to take more than a modest stake of the centre.",
  "Anderssen Opening": "Anderssen's Opening is a chess opening defined by the opening move:\n1. a3\nAnderssen's Opening is named after unofficial World Chess Champion Adolf Anderssen, who played it three times in his 1858 match against Paul Morphy. While Anderssen was defeated decisively in the match, the games he opened with this novelty scored 1½/3 (one win, one loss, one draw).\nAs Anderssen's Opening is not commonly played, it is considered an irregular opening. The move is classified under the A00 code in the Encyclopaedia of Chess Openings.\n\n\n== Discussion ==\nThis opening move does little for development or control of the center.",
  "Clemenz Opening": "The Clemenz Opening is a chess opening beginning with the move:\n1. h3\nThis opening is named after Hermann Clemenz (1846–1908), an Estonian player. It is considered an irregular opening, and is classified under the code A00 (miscellaneous first moves by White) in the Encyclopaedia of Chess Openings.\n\n\n== Discussion ==\nLike Anderssen's Opening, 1.a3, 1.h3 is a time-wasting move, as it makes no claim on the central squares, nor does it aid development. It also leads to a slight weakening of White's kingside, albeit not as severely as Grob's Attack (1.g4) or Barnes Opening (1.f3). Since there is no need for White to make such a time-wasting first move, it is among the rarest of the 20 possible first moves.",
  "Barnes Opening": "Barnes Opening is a chess opening where White opens with:\n1. f3\nThe opening is named after Thomas Wilson Barnes (1825–1874), an English player who had an impressive eight wins over Paul Morphy, including one game where Barnes answered 1.e4 with 1...f6, known as Barnes Defence.\nIt is considered an irregular opening, so it is classified under the A00 code in the Encyclopaedia of Chess Openings.\n\n\n== Strategy ==\nOf the twenty possible first moves in chess, author and grandmaster Edmar Mednis argues that 1.f3 is the worst. The move does exert influence over the central square e4, but the same or more ambitious goals can be achieved with almost any other first move. The move 1.f3 does not develop a piece, opens no lines for pieces, and actually hinders the development of White's king knight by denying it its most natural square, f3.",
  "Grob Opening": "Grob's Attack is an unconventional chess opening where White immediately moves the king knight's pawn two squares ahead:\n1. g4\n\n\n== History and usage ==\nThe opening takes its name from Swiss International Master Henri Grob (1904–1974) who analyzed it extensively and played hundreds of correspondence games with it. In Grob's newspaper column analysis of this opening, he referred to it as the Spike Opening, a name which is still used occasionally. Other early references used the name Ahlhausen's Opening, after Carl Ahlhausen (1835–1892) of Berlin, one of the first to play 1.g4. Savielly Tartakower sometimes played this opening in simultaneous exhibitions and called it the Genoa or San Pier D'Arena Opening, after the city and suburb of Genoa where he first used it. In the Czech Republic and Slovakia, 1.g4 is called Fric's Opening, and in other parts of the world it is called Kolibri's Opening.",
  "Hungarian Opening": "The King's Fianchetto Opening or Benko's Opening (also known as the Hungarian Opening, Barcza Opening, or Bilek Opening) is a chess opening characterized by the move:\n1. g3\nWhite's 1.g3 ranks as the fifth most popular opening move, but it is far less popular than 1.e4, 1.d4, 1.c4 and 1.Nf3. It is usually followed by 2.Bg2, fianchettoing the bishop. Nick de Firmian writes that 1.g3 \"can, and usually does, transpose into almost any other opening in which White fianchettos his king's bishop\". Included among these are the Catalan Opening, the King's Indian Attack and some variations of the English Opening. For this reason, the Encyclopaedia of Chess Openings has no specific code devoted to 1.g3.",
  "Kadas Opening": "The Desprez Opening is a chess opening characterized by the opening move:\n1. h4\nThe opening is named after the French player Marcel Desprez. Like a number of other rare openings, 1.h4 has some alternate names such as Kadas Opening (after Gabor Kadas, a Hungarian player), Anti-Borg Opening, Samurai Opening, and Reagan's Attack (according to Eric Schiller's Unorthodox Chess Openings, the latter is a political gibe against Ronald Reagan, since 1. h4 is \"thoroughly unmotivated and creates weaknesses with only vague promises of future potential\").\nAs the Desprez Opening is very rare, it is considered an irregular opening, so it is classified under the A00 code in the Encyclopaedia of Chess Openings.\n\n\n== Assessment ==\nLike 1.a4, the Ware Opening, 1.h4 is an irrelevant pawn move which does nothing in the fight over central space, and does very little for development.",
  "Mieses Opening": "The Mieses Opening is a chess opening that begins with the move:\n1. d3\nThe opening is named after the German-British grandmaster Jacques Mieses. It is considered an irregular opening, so it is classified under the A00 code in the Encyclopaedia of Chess Openings (ECO).\n\n\n== Description ==\nWhite's 1.d3 releases his c1-bishop and makes a modest claim for the centre, but since it does not stake out as large a share of the centre as 1.d4 does, it is not a popular opening move. Of the twenty possible first moves for White, it ranks tenth in popularity. Nevertheless, since 1...d6 is playable by Black against any opening move from White, the corresponding move is playable by White as well.",
  "Polish Opening": "The Sokolsky Opening (also known as the Orangutan or Polish) is an uncommon chess opening that begins with the move:\n1. b4\nAccording to various databases, out of the twenty possible first moves from White, the move 1.b4 ranks ninth in popularity. It is considered an irregular opening, so it is classified under the A00 code in the Encyclopaedia of Chess Openings (ECO).\n\n\n== Details ==\nThe opening has never been popular at the top level, though a number of prominent players have employed it on occasion (for example, Richard Réti against Abraham Speijer in Scheveningen 1923 and Boris Spassky against Vasily Smyslov in the 1960 Moscow–Leningrad match). Soviet player Alexei Pavlovich Sokolsky (1908–1969) wrote a monograph on this opening in 1963, Debyut 1 b2–b4.\nPerhaps its most famous use came in the game Tartakower versus Maróczy, in the New York 1924 chess tournament on March 21, 1924.",
  "Saragossa Opening": "The Saragossa Opening is a chess opening defined by the opening move:\n1. c3\nSince White usually plays more aggressively in the opening, the Saragossa is considered an irregular opening, classified as A00 by the Encyclopaedia of Chess Openings.\n\n\n== History ==\nThis opening became popular in the Saragossa chess club (Zaragoza, Spain) in 1919. The next year club member José Juncosa analyzed the opening in Revista del Club Argentino. In 1922 a theme tournament requiring the players to open with 1.c3 was arranged in Mannheim with three participants, Siegbert Tarrasch, Paul Leonhardt and Jacques Mieses, which Tarrasch won.\n\n\n== Basics ==\nThe opening of 1.c3 seems at first to be an unambitious move.",
  "Sodium Attack": "The Durkin Opening (also known as the Durkin Attack or the Sodium Attack) is a rarely played chess opening beginning with the move:\n1. Na3\nThe Durkin Opening is named for Robert James Durkin (1923–?) of New Jersey. The name \"Sodium Attack\" (used by Eric Schiller in Unorthodox Chess Openings) comes from the algebraic notation 1.Na3, as Na is the chemical symbol for the element sodium.\n\n\n== Assessment ==\nThis awkward development of the queen's knight does little to utilize White's advantage of the first move. From a3 the knight does not influence the center or possess much activity. It is likely that White will move this knight again soon, perhaps by playing c4 and either recapturing on c4 (e.g.",
  "Dunst Opening": "The Dunst Opening is a chess opening where White opens with the move:\n1. Nc3\nThis fairly uncommon opening may have more names than any other: it is also called the Heinrichsen Opening, Baltic Opening, van Geet's Opening, Sleipnir Opening, Kotrč's Opening, Meštrović Opening, Romanian Opening, Queen's Knight Attack, Queen's Knight Opening, Millard's Opening, Knight on the Left, and (in German) der Linksspringer.\n\n\n== Origin of names ==\nThe names Heinrichsen and Baltic derive from Lithuanian chess player Arved Heinrichsen (1876–1900). The opening was analyzed and played by the New York master Ted A. Dunst (April 11, 1907 New York City – December 18, 1985 Lambertville, New Jersey), giving the opening its most popular name in the United States. The Dutch International Master and correspondence grandmaster Dirk Daniel (\"Dick D.\") van Geet (March 1, 1932 – April 29, 2012) frequently played 1.Nc3, so it is often called the van Geet's Opening in the Netherlands. The appellation Sleipnir seems to come from Germany.",
  "Van't Kruijs Opening": "The Van't Kruijs Opening (Dutch pronunciation: [vɑn ət ˈkrœys]) is a chess opening defined by the move:\n1. e3\nIt is named after the Amsterdam player Maarten van 't Kruijs (1813–85) who won the sixth Dutch championship in 1878. As this opening move is rarely played, it is considered an irregular opening, and thus it is classified under the A00 code in the Encyclopaedia of Chess Openings (ECO).\nThe opening 1.e3 is not popular according to ChessBase; it ranks eleventh in popularity out of the twenty possible first moves. It releases the king's bishop, and makes a modest claim of the centre, but the move is somewhat passive. The queen's bishop's development is somewhat hindered by the pawn on e3, and White usually wants to take more than a modest stake of the centre.",
  "Ware Opening": "The Ware Opening, also known as Meadow Hay Opening, is an uncommon chess opening for White beginning with the move:\n1. a4\nIt is named after Preston Ware, a U.S. chess player who often played uncommon openings. The Ware is considered an irregular opening; it is classified under the A00 code in the Encyclopaedia of Chess Openings.\n\n\n== Opening idea ==\nThe Ware Opening attacks the b5-square and prepares to bring the a1-rook into the game. The b5-square is non-essential and if Black plays 1...e5, the f8-bishop prevents the development of the white rook for the moment. The reply 1...e5 also gains space for Black in the center, a typical objective of most openings but one completely ignored by the Ware Opening.",
  "Nimzo-Larsen Attack": "Larsen's Opening (also called the Nimzo-Larsen Attack or Queen's Fianchetto Opening) is a chess opening starting with the move:\n1. b3\nIt is named after the Danish grandmaster Bent Larsen. Larsen was inspired by the example of the great Latvian-Danish player and theoretician Aron Nimzowitsch (1886–1935), who often played 1.Nf3 followed by 2.b3, which is sometimes called the Nimzowitsch–Larsen Attack. It is classified under the A01 code in the Encyclopaedia of Chess Openings.\nThe flank opening move 1.b3 prepares to fianchetto the queen's bishop where it will help control the central squares in hypermodern fashion and put useful pressure on Black's kingside. The b2-bishop is often a source of recurring irritation for Black, who should not treat it lightly.",
  "Bird Opening": "Bird's Opening (or the Dutch Attack) is a chess opening characterised by the move:\n1. f4\nBird's is a standard flank opening. White's strategic ideas involve control of the e5-square, offering good attacking potential at the expense of slightly weakening his kingside. Black may challenge White's plan to control e5 immediately by playing From's Gambit (1...e5); however, the From's Gambit is notoriously double-edged and should only be played after significant study.\nThe Encyclopaedia of Chess Openings assigns two codes for Bird's Opening: A02 (1.f4) and A03 (1.f4 d5).\n\n\n== History ==\nThe opening was mentioned by Luis Ramírez de Lucena in his book Repetición de Amores y Arte de Ajedrez con Cien Juegos de Partido, published c.",
  "Zukertort Opening": "The Zukertort Opening is a chess opening named after Johannes Zukertort that begins with the move:\n1. Nf3\nSometimes the term \"Réti Opening\" is used to describe the opening move 1.Nf3, although most sources define the Réti more narrowly as the sequence 1.Nf3 d5 2.c4.\nA flank opening, it is the third most popular of the twenty legal opening moves White has, behind only 1.e4 and 1.d4.\nThe move has been described by Edmar Mednis as a \"perfect and flexible opening\" and by others such as Aron Nimzowitsch as \"certainly the most solid move, whereas moves such as 1.e4 and 1.d4 are both 'committal' and 'compromising'.\" The game can transpose into a large number of other openings which usually start with 1.e4, 1.d4, or 1.c4. In most games, 1.Nf3 transposes into another opening. If Black is not careful, there is the risk of running unprepared into a highly theoretical opening, e.g.",
  "King's Indian Attack": "The King's Indian Attack (or KIA), also known as the Barcza System (after Gedeon Barcza), is a chess opening system for White.\nThe opening is not a series of specific moves, but rather a system that can be played from many different move orders. Though the KIA is often reached via 1.e4 followed by d3, Nd2, Ngf3, g3, Bg2, and 0-0, it can also arise from 1.g3, 1.Nf3, or even 1.d3.\n\n\n== Characteristics ==\nThe KIA is a mirror image of the setup adopted by Black in the King's Indian Defence. Yet, because of White's extra tempo, the nature of the subsequent play is often different from that of a typical King's Indian Defence.\nBy its nature, the KIA is a closed, strategic opening that presents its practitioner with common themes and tactics and a comfortable middlegame against various defences.",
  "English Opening": "The English Opening is a chess opening that begins with the move:\n1. c4\nA flank opening, it is the fourth most popular and, according to various databases, anywhere from one of the two most successful to the fourth most successful of White's twenty possible first moves. White begins the fight for the centre by staking a claim to the d5-square from the wing, in hypermodern style. Although many lines of the English have a distinct character, the opening is often used as a transpositional device in much the same way as 1.Nf3 – to avoid such highly regarded responses to 1.d4 as the Nimzo-Indian and Grünfeld Defences, and is considered reliable and flexible.\nThe English derives its name from the English (unofficial) world champion Howard Staunton, who played it during his 1843 match with Saint-Amant and at London 1851, the first international tournament. It did not inspire Staunton's contemporaries and only caught on in the twentieth century.",
  "English Defense": "The English Defence is a chess opening characterised by the moves:\n1. d4 e6\n2. c4 b6\n\n\n== Description ==\nWhite often gains a broad pawn centre with 3.e4, which Black puts pressure on with moves like ...Bb7, ...Bb4, and sometimes even ...Qh4 and/or ...f5. It was developed by the Leicester player P. N. Wallis, and was taken up by several leading English players in the 1970s, such as Tony Miles, Jon Speelman and Raymond Keene. It flouts several traditional opening principles, as Black often develops bishops before knights and brings out the queen early. It is a somewhat unusual opening, but has been seen in high-level grandmaster play, usually as a surprise weapon, for example when Viktor Korchnoi used it to defeat Lev Polugaevsky in their world championship semifinals match at Évian 1977 (see below).",
  "Englund Gambit": "The Englund Gambit is a rarely played chess opening that starts with the moves:\n1. d4 e5?!\nBlack's idea is to avoid the traditional closed queen's pawn games and create an open game with tactical chances, but at the cost of a pawn. The gambit is considered weak; Boris Avrukh writes that 1...e5 \"seems to me the worst possible reply to White's first move\". It is almost never seen in top-level play, although Paul Keres once tried it. The gambit is occasionally seen in amateur games and in correspondence chess, and the 3...Qe7 version of the gambit was frequently used by Henri Grob.",
  "Horwitz Defense": "Anatoly Vaisser (born 5 March 1949 in Almaty) is a Soviet-born French chess grandmaster and four-time world seniors champion.\n\n\n== Career ==\nIn 1982 he won the Russian Chess Championship. Vaisser shared first with Evgeny Sveshnikov at Sochi in 1983, tied for 2nd and 3rd with Viswanathan Anand, behind István Csom, at New Delhi in 1987, and took second, behind Vladimir Malaniuk, at Budapest in 1989. He tied for first in the Cappelle-la-Grande Open twice: in 1987 with Anthony Kosten and Jonny Hector, and in 1991 with Matthew Sadler.\nSince 1991, Vaisser has represented France. He won the French championship at Narbonne 1997, and was twice runner-up (1996 and 2001).",
  "Mikenas Defense": "The Queen's Knight Defense (also known as the Nimzowitsch Queen Pawn Defence or Bogoljubow–Mikenas Defense) is a chess opening defined by the moves:\n1. d4 Nc6\nUnless the game transposes to another opening, the Encyclopedia of Chess Openings code for the Queen's Knight Defense is A40.\n\n\n== Discussion ==\nThis opening was tried by some hypermodern players such as Aron Nimzowitsch and Efim Bogoljubov, but it has never become very popular. The move 1...Nc6 is a fairly committal move which blocks Black's c-pawn; usually Black delays playing it until White's setup is clear.\nMost games featuring 1.d4 Nc6 transpose to another opening. After 2.e4 the Nimzowitsch Defense arises.",
  "Modern Defense": "The Modern Defense (also known as the Robatsch Defence after Karl Robatsch) is a hypermodern chess opening in which Black allows White to occupy the center with pawns on d4 and e4, then proceeds to attack and undermine this \"ideal\" center without attempting to occupy it himself. The opening has been most notably used by British grandmasters Nigel Davies and Colin McNab.\nThe Modern Defense is closely related to the Pirc Defence, the primary difference being that in the Modern, Black delays developing his knight to f6. The delay of ...Nf6 attacking White's pawn on e4 gives White the option of blunting the g7-bishop with c2–c3. There are numerous transpositional possibilities between the two openings.\nThe Encyclopaedia of Chess Openings (ECO) classifies the Modern Defense as code B06, while codes B07 to B09 are assigned to the Pirc.",
  "Polish Defense": "The Polish Defense is the name commonly given to one of several sequences of chess opening moves characterized by an early ...b5 by Black. The name \"Polish Defense\" is given by analogy to the Polish Opening (ECO A40), 1.b4. The original line was\n1. d4 b5\nas played by Alexander Wagner, a Polish player and openings analyst, against Kuhn in the 1913 Swiss Correspondence Championship. Wagner published an analysis of the opening in Deutsches Wochenschach in 1914, when he was living in Stanislau, Galicia, Austria-Hungary (now Ivano-Frankivsk, Ukraine). Later the name was also applied to\n1.d4 Nf6\n2.Nf3 b5\nand other variants where Black delays playing ...b5 until the second or third move, which are sometimes called the Polish Defense Deferred.",
  "Queen's Pawn": "The Queen's Pawn Game is any chess opening starting with the move:\n1. d4\nIt is the second most popular opening move after 1.e4. The name is usually used to describe openings beginning with 1.d4 where White does not play the Queen's Gambit. The most common Queen's Pawn Game openings are:\nThe London System, 2.Bf4 or 2.Nf3 and 3.Bf4\nThe Trompowsky Attack, 1...Nf6 2.Bg5 and the Pseudo-Trompowsky 1...d5 2.Bg5\nThe Torre Attack, 2.Nf3 and 3.Bg5\nThe Stonewall Attack, 2.e3\nThe Colle System, 2.Nf3 and 3.e3,\nThe Kingside Fianchetto, 2.Nf3 and 3.g3\nThe Barry Attack, 1...Nf6 2.Nf3 g6 3.Nc3 d5 4.Bf4\nThe Richter-Veresov Attack, 1...d5 2.Nc3 Nf6 3.Bg5 or 1...Nf6 2.Nc3 d5 3.Bg5\nThe Blackmar–Diemer Gambit, 1...d5 2.e4, and the Hübsch Gambit 1...Nf6 2.Nc3 d5 3.e4\nIn the Encyclopedia of Chess Openings (ECO), Closed Games (1.d4 d5) are classified under codes D00–D05. Openings where Black does not play 1...d5 are called Semi-Closed Games and classified as:\nIndian Defenses, where Black plays 1...Nf6 (ECO codes A45–A79, D70–D99, E00–E99); for instance the Queen's Indian Defense (ECO E12–E19);\nother Queen's Pawn Games, where Black plays neither 1...d5 nor 1...Nf6; these include the Dutch Defence (ECO A40–A44 and A80–A99).\n\n\n== History ==\nIn the 19th century and early 20th century, 1.e4 was by far the most common opening move by White (Watson 2006:87), while the different openings starting with 1.d4 were considered somewhat unusual and therefore classed together as \"Queen's Pawn Game\".",
  "Old Indian Defense": "The Old Indian Defense is a chess opening defined by the moves:\n1. d4 Nf6\n2. c4 d6\nThis opening is distinguished from the King's Indian Defense in that Black develops his king's bishop on e7 rather than by fianchetto on g7. Mikhail Chigorin pioneered this defense late in his career.\nThe Old Indian is considered sound, though developing the bishop at e7 is less active than the fianchetto, and it has never attained the popularity of the King's Indian. Some King's Indian players will use the Old Indian to avoid certain anti-King's Indian systems, such as the Sämisch and Averbakh Variations.",
  "Wade Defense": "The Wade Defence is a chess opening characterised by the initial moves:\n1. d4 d6\n2. Nf3 Bg4\nThe position can also arise from the move order 1.Nf3 d6 2.d4 Bg4.\n\n\n== History ==\nThe opening is named after British IM Bob Wade (1921–2008), originally from New Zealand, who played it for over 30 years. A number of grandmasters have often played the opening, including Julian Hodgson, Michael Adams, Vlastimil Jansa, and Tony Miles.\nJouni Yrjölä and Jussi Tella, in their book An Explosive Chess Opening Repertoire for Black, state that the opening:\n\n[...] was played in 1938 by Rudolf Spielmann and used in the 1960s by Stein and Kavalek among others ...",
  "Semi-Benoni": "The Benoni Defense is a chess opening characterized by the moves:\n1. d4 Nf6\n2. c4 c5\n3. d5\nBlack can then sacrifice a pawn with 3...b5 (the Benko Gambit), otherwise 3...e6 is the most common move (although 3...d6 or 3...g6 are also seen, typically transposing to main lines).\n\n\n== Etymology ==\n\"Ben oni\" (בֶּן אוֹנִי) is a Hebrew term meaning \"son of my sorrow\" (cf. Genesis 35:18) – the name of an 1825 book by Aaron Reinganum about several defenses against the King's Gambit and the Queen's Gambit.",
  "Indian Game": "The Cornish or Indian Game is a breed of chicken from the county of Cornwall in England. Cornish chickens, as well as crosses of Cornishes, are the most-used breed in the chicken meat industry. They are heavy, muscular birds that lay brown eggs.\n\n\n== Name ==\nThe Cornish is known variously by Indian or Cornish Game depending on country. In America it was originally always known as Indian Game, until 1905 when the American Poultry Association passed a motion to rename the breed to Cornish Indian Game. Due to the confusion the name caused by implying the breed came from India, and unpopularity of the use of Game in the name, it was renamed to simply the Cornish in 1910.",
  "Trompowsky Attack": "The Trompowsky Attack is a chess opening that begins with the moves:\n1. d4 Nf6\n2. Bg5\nWith his second move, White intends to exchange his bishop for Black's knight, inflicting doubled pawns upon Black in the process. This is not a lethal threat; Black can choose to fall in with White's plan.\nThe Trompowsky is a popular alternative to the more common lines after 1.d4 Nf6 beginning 2.c4 or 2.Nf3. By playing 2.Bg5, White sidesteps immense bodies of opening theory of various Indian Defences like the Queen's Indian, King's Indian, Nimzo-Indian, as well as the Grünfeld Defence.",
  "Torre Attack": "The Torre Attack is a chess opening characterized by the moves:\n1. d4 Nf6\n2. Nf3 e6\n3. Bg5 (ECO code A46)\nor the Tartakower Variation in the Queen's Pawn Game (ECO code D03):\n2... d5\n3. Bg5\nor the Torre Attack in the King's Indian Defence (ECO code A48):\n2...",
  "Marienbad System": "Mariánské Lázně (Czech pronunciation: [ˈmarɪjaːnskɛː ˈlaːzɲɛ]; German: Marienbad) is a spa town in the Karlovy Vary Region of the Czech Republic. The town, surrounded by green mountains, is a mosaic of parks and noble houses. Most of its buildings come from the town's Golden Era in the second half of the 19th century, when many celebrities and top European rulers came to enjoy the curative carbon dioxide springs.\n\n\n== History ==\n\nGerman settlers were called into this region by Bohemian rulers from the Přemyslid dynasty in the 12th Century.\n\nAlthough the town itself is only about two hundred years old, the locality has been inhabited much longer. The first written record dates back to 1273, when there was a village of Úšovice.",
  "Queen's Indian Defense": "The Queen's Indian Defense (QID) is a chess opening defined by the moves:\n1. d4 Nf6\n2. c4 e6\n3. Nf3 b6\nThe opening is a solid defense to the Queen's Pawn Game. 3...b6 increases Black's control over the central light squares e4 and d5 by preparing to fianchetto the queen's bishop, with the opening deriving its name from this maneuver. As in the other Indian defenses, Black attempts to control the center with pieces, instead of occupying it with pawns in classical style.",
  "London System": "The London System is a chess opening that usually arises after 1.d4 and 2.Bf4 or 2.Nf3 & 3.Bf4. It is a \"system\" opening that can be used against virtually any black defense and thus comprises a smaller body of opening theory than many other openings. The London System is one of the Queen's Pawn Game openings where White opens with 1.d4 but does not play the Queen's Gambit. It normally results in a closed game.\nSverre Johnsen and Vlatko Kovačević, in the introduction to their 2005 book Win with the London System, state:\n\nBasically the London is a set of solid lines where after 1.d4 White quickly develops his dark-squared bishop to f4 and normally bolsters his centre with [pawns on] c3 and e3 rather than expanding. Although it has the potential for a quick kingside attack, the white forces are generally flexible enough to engage in a battle anywhere on the board.",
  "East Indian Defense": "The East Indian Defence is a chess opening characterised by the moves:\n1. d4 Nf6\n2. Nf3 g6\n\n\n== Description ==\nThis opening has a close kinship to the more-common King's Indian Defence and is often considered a variant thereof. The difference is that White has not yet played c4, and therefore retains some options.\nIf White plays an early c4, the opening will transpose into a King's Indian. It is also possible for White to support an early e4 advance, transposing into the Pirc Defence.",
  "Mexican Defense": "The Black Knights' Tango (also known as the Mexican Defense or Kevitz–Trajkovic Defense) is a chess opening beginning with the moves:\n1. d4 Nf6\n2. c4 Nc6\nThis position can also be reached by transposition, for example 1.c4 Nf6, 1.d4 Nc6, or 1.c4 Nc6.\n\n\n== History ==\nThe opening originated in the 1920s, when it was played by both the Mexican grandmaster Carlos Torre (hence the name \"Mexican Defense\") and the American master Alexander Kevitz (the \"Kevitz\" in \"Kevitz–Trajkovic Defense\"). Torre used it to defeat then-U.S. Chess Champion Frank James Marshall in only seven moves. It was later played by the Yugoslav master Mihailo Trajkovic and the Soviet grandmaster Anatoly Lutikov.",
  "Budapest Defense": "The Budapest Gambit (or Budapest Defence) is a chess opening that begins with the moves:\n1. d4 Nf6\n2. c4 e5\nDespite an early debut in 1896, the Budapest Gambit received attention from leading players only after a win as Black by Grandmaster Milan Vidmar over Akiba Rubinstein in 1918. It enjoyed a rise in popularity in the early 1920s, but nowadays is rarely played at the top level. It experiences a lower percentage of draws than other main lines, but also a lower overall performance for Black.\nAfter 3.dxe5 Black can try the Fajarowicz variation 3...Ne4 which concentrates on the rapid development of pieces, but the most common move is 3...Ng4 with three main possibilities for White.",
  "Benoni Defense": "The Benoni Defense is a chess opening characterized by the moves:\n1. d4 Nf6\n2. c4 c5\n3. d5\nBlack can then sacrifice a pawn with 3...b5 (the Benko Gambit), otherwise 3...e6 is the most common move (although 3...d6 or 3...g6 are also seen, typically transposing to main lines).\n\n\n== Etymology ==\n\"Ben oni\" (בֶּן אוֹנִי) is a Hebrew term meaning \"son of my sorrow\" (cf. Genesis 35:18) – the name of an 1825 book by Aaron Reinganum about several defenses against the King's Gambit and the Queen's Gambit.",
  "Benko Gambit": "The Benko Gambit (or Volga Gambit) is a chess opening characterised by the move 3...b5 in the Benoni Defence arising after:\n1. d4 Nf6\n2. c4 c5\n3. d5 b5\nThe Encyclopaedia of Chess Openings has three codes for the Benko Gambit:\nA57 3...b5\nA58 3...b5 4.cxb5 a6 5.bxa6\nA59 3...b5 4.cxb5 a6 5.bxa6 Bxa6 6.Nc3 d6 7.e4\n\n\n== Origin and predecessors ==\nThe idea of sacrificing a pawn with ...b5 and ...a6 is quite old. Karel Opočenský applied the idea against, among others, Gideon Ståhlberg at Poděbrady 1936, Paul Keres at Pärnu 1937, Erich Eliskases at Prague 1937, and Theo van Scheltinga at the Buenos Aires Chess Olympiad 1939. Later the Mark Taimanov versus David Bronstein game at the Candidates Tournament, Zürich 1953, drew attention.",
  "Dutch Defense": "The Dutch Defence is a chess opening characterised by the moves:\n1. d4 f5\nBlack's 1...f5 stakes a serious claim to the e4-square and envisions an attack in the middlegame on White's kingside; however, it also weakens Black's kingside some (especially the e8–h5 diagonal) and contributes nothing to Black's development. Like its 1.e4 counterpart, the Sicilian Defence, the Dutch is an aggressive and unbalancing opening, resulting in the lowest percentage of draws among the most common replies to 1.d4. Through the ages White has tried all sorts of methods to exploit the kingside weaknesses, such as the Staunton Gambit (2.e4) and Korchnoi Attack (2.h3 and 3.g4), but Black's resources seem just about adequate.\nThe Dutch has never been a main line against 1.d4 and is rarely seen at high level, although a number of top players, including Alexander Alekhine, Bent Larsen, Paul Morphy and Miguel Najdorf, have used it with success. Perhaps its high-water mark occurred in 1951 when both World Champion Mikhail Botvinnik and his challenger, David Bronstein, played it in their 1951 World Championship match.",
  "Borg Defense": "The King's Pawn Game is any chess opening starting with the move:\n1. e4\nIt is among the most popular opening moves in chess.\n\n\n== Details about the move and the game plan ==\nWhite opens with the most popular of the twenty possible opening moves. Although effective in winning for White (54.25%), it is not quite as successful as the four next most common openings for White: 1.d4 (55.95%), 1.Nf3 (55.8%), 1.c4 (56.3%), and 1.g3 (55.8%). Since nearly all openings beginning 1.e4 have names of their own, the term \"King's Pawn Game\", unlike Queen's Pawn Game, is rarely used to describe the opening of the game.\nAdvancing the king's pawn two squares is highly useful because it occupies a center square, attacks the center square d5, and allows the development of White's king's bishop and queen.",
  "Goldsmith Defense": "The King's Pawn Game is any chess opening starting with the move:\n1. e4\nIt is among the most popular opening moves in chess.\n\n\n== Details about the move and the game plan ==\nWhite opens with the most popular of the twenty possible opening moves. Although effective in winning for White (54.25%), it is not quite as successful as the four next most common openings for White: 1.d4 (55.95%), 1.Nf3 (55.8%), 1.c4 (56.3%), and 1.g3 (55.8%). Since nearly all openings beginning 1.e4 have names of their own, the term \"King's Pawn Game\", unlike Queen's Pawn Game, is rarely used to describe the opening of the game.\nAdvancing the king's pawn two squares is highly useful because it occupies a center square, attacks the center square d5, and allows the development of White's king's bishop and queen.",
  "Hippopotamus Defense": "The Hippopotamus Defence is a name for various irregular chess opening systems in which Black moves a number of his pawns to the sixth rank, often developing his pieces to the seventh rank, and does not move any of his pawns to the fifth rank in the opening.\n\n\n== Evaluation ==\n\nChess master and author Fred Reinfeld once stated of it that \"any expert player would dismiss Black's position as lost.\" Grandmaster Reuben Fine, one of the world's strongest players in the 1930s and 1940s, instructing his readers how to deal with such \"Irregular Openings\", wrote that \"once a plus in development or center is set up, a well-conducted attack will decide.\"\nReinfeld, who died in 1964, might have been surprised to see Black employing the same system of development successfully in the 1966 world championship match. There, Boris Spassky employed the same set-up, dubbed the \"Hippopotamus\" by commentators, in the 12th and 16th match games against World Champion Tigran Petrosian. In both games Spassky developed his bishops to b7 and g7, and his knights to d7 and e7. (See diagrams.) Both games ended in draws. (See illustrative games below.)\n\nIn employing this system against Petrosian, Spassky was likely inspired by the Slovak International Master Maximilian Ujtelky, who had been experimenting with similar openings for several years.",
  "King's Pawn": "The King's Pawn Game is any chess opening starting with the move:\n1. e4\nIt is among the most popular opening moves in chess.\n\n\n== Details about the move and the game plan ==\nWhite opens with the most popular of the twenty possible opening moves. Although effective in winning for White (54.25%), it is not quite as successful as the four next most common openings for White: 1.d4 (55.95%), 1.Nf3 (55.8%), 1.c4 (56.3%), and 1.g3 (55.8%). Since nearly all openings beginning 1.e4 have names of their own, the term \"King's Pawn Game\", unlike Queen's Pawn Game, is rarely used to describe the opening of the game.\nAdvancing the king's pawn two squares is highly useful because it occupies a center square, attacks the center square d5, and allows the development of White's king's bishop and queen.",
  "Nimzowitsch Defense": "The Nimzowitsch Defence is a somewhat unusual chess opening characterised by the moves:\n1. e4 Nc6\nThis opening is an example of a hypermodern opening where Black invites White to occupy the centre of the board at an early stage with pawns. Black's intent is to block or otherwise restrain White's central pawns and, if allowed to do so by inaccurate play by White, eventually undermine the White pawn centre by well-timed pawn advances of his own or by attacking the white pieces defending the centre. World Champion Garry Kasparov and Grandmaster Raymond Keene wrote that it \"has never been fully accepted as a dependable opening. Nevertheless it is sound and offers the maverick spirit a great deal of foreign territory to explore.\"\nThe Nimzowitsch is included under code B00 in the Encyclopaedia of Chess Openings.\n\n\n== Main line: 2.d4 ==\nWhite takes the initiative in the centre.",
  "Owen Defense": "Owen's Defence (also known as the Queen's Fianchetto Defence or Greek Defense) is an uncommon chess opening defined by the moves:\n1. e4 b6\nBy playing 1...b6, Black prepares to fianchetto the queen's bishop where it will participate in the battle for the centre. The downside of this plan is that White can occupy the centre with pawns and gain a spatial advantage. Moreover, 1...b6 does not prepare kingside castling as 1...g6 does, and it is harder for Black to augment his pressure against the centre with ...f5, which weakens the kingside, than it is to play the corresponding move ...c5 after 1...g6. Owen's Defence accordingly has a dubious reputation. The move ...b6 has been played on the first or second move by grandmasters Jonathan Speelman, Pavel Blatny, Tony Miles, Edvins Kengis, and Normunds Miezis, and International Masters Bricard and Filipovic.",
  "St. George Defense": "The St. George Defence (also known as the Baker's Defence, Birmingham Defence, or Basman Counterattack) is an unorthodox chess opening for Black. The opening begins with the moves:\n1. e4 a6\nThe St. George Defence is given ECO code B00 as a King's Pawn Opening.\n\n\n== History ==\nThe first known chess game involving the St.",
  "Scandinavian Defense": "The Scandinavian Defense (or Center Counter Defense, or Center Counter Game) is a chess opening characterized by the moves:\n1. e4 d5\n\n\n== History ==\n\n\n=== Origin ===\nThe Center Counter Defense is one of the oldest recorded openings, first recorded as being played between Francesc de Castellví and Narcís Vinyoles in Valencia in 1475 in what may be the first recorded game of modern chess, and being mentioned by Lucena in 1497.\n\n\n=== 19th and early 20th centuries ===\nAnalysis by Scandinavian masters in the late 19th century showed it is playable for Black; Ludvig Collijn played the opening with success. Although the Center Counter Defense has never enjoyed widespread popularity among top-flight players, Joseph Henry Blackburne and Jacques Mieses often played it, and greatly developed its theory in the late 19th and early 20th centuries. It was an occasional choice in this era for top players including Siegbert Tarrasch, Rudolph Spielmann, and Savielly Tartakower. Alexander Alekhine used it to draw against World Champion Emanuel Lasker at St.",
  "Alekhine Defense": "Alekhine's Defence is a chess opening which begins with the moves:\n1. e4 Nf6\nBlack tempts White's pawns forward to form a broad pawn centre, with plans to undermine and attack the white structure later in the spirit of hypermodern defence. White's imposing mass of pawns in the centre often includes pawns on c4, d4, e5, and f4. Grandmaster Nick de Firmian observes of Alekhine's Defence in MCO-15 (2008), \"The game immediately loses any sense of symmetry or balance, which makes the opening a good choice for aggressive fighting players.\"\nThe Encyclopaedia of Chess Openings has four codes for Alekhine's Defence, B02 through B05:\nB02: 1.e4 Nf6\nB03: 1.e4 Nf6 2.e5 Nd5 3.d4 (including the Exchange Variation and Four Pawns Attack)\nB04: 1.e4 Nf6 2.e5 Nd5 3.d4 d6 4.Nf3 (Modern Variation without 4...Bg4)\nB05: 1.e4 Nf6 2.e5 Nd5 3.d4 d6 4.Nf3 Bg4 (Modern Variation with 4...Bg4)\n\n\n== History ==\nThe opening is named after Alexander Alekhine, who introduced it in the 1921 Budapest tournament in games against Endre Steiner and Fritz Sämisch. Four years later, the editors of the Fourth Edition of Modern Chess Openings (MCO-4) wrote:\n\nNothing is more indicative of the iconoclastic conceptions of the 'hypermodern school' than the bizarre defence introduced by Alekhine ... . Although opposing to all tenets of the classical school, Black allows his King's Knight to be driven about the board in the early stages of the game, in the expectation of provoking a weakness in White's centre pawns.",
  "Zaire Defense": "Zaire (), officially the Republic of Zaire (French: République du Zaïre; French pronunciation: ​[za.iʁ]), was the name for the Democratic Republic of the Congo that existed between 1971 and 1997 in Central Africa. The country was a one-party totalitarian dictatorship, run by Mobutu Sese Seko and his ruling Popular Movement of the Revolution party. Zaire was established following Mobutu's seizure of power in a military coup in 1965, following five years of political upheaval following independence known as the Congo Crisis. Zaire had a strongly centralist constitution and foreign assets were nationalised. The period is sometimes referred to as the Second Congolese Republic.\nA wider campaign of Authenticité, ridding the country of the influences from the colonial era of the Belgian Congo, was also launched under Mobutu's direction.",
  "Robatsch (Modern) Defense": "The Modern Defense (also known as the Robatsch Defence after Karl Robatsch) is a hypermodern chess opening in which Black allows White to occupy the center with pawns on d4 and e4, then proceeds to attack and undermine this \"ideal\" center without attempting to occupy it himself. The opening has been most notably used by British grandmasters Nigel Davies and Colin McNab.\nThe Modern Defense is closely related to the Pirc Defence, the primary difference being that in the Modern, Black delays developing his knight to f6. The delay of ...Nf6 attacking White's pawn on e4 gives White the option of blunting the g7-bishop with c2–c3. There are numerous transpositional possibilities between the two openings.\nThe Encyclopaedia of Chess Openings (ECO) classifies the Modern Defense as code B06, while codes B07 to B09 are assigned to the Pirc.",
  "Pirc Defense": "The Pirc Defence (correctly pronounced \"peerts\", but often mispronounced \"perk\"), sometimes known as the Ufimtsev Defence or Yugoslav Defence, is a chess opening characterised by Black responding to 1.e4 with 1...d6 and 2...Nf6, followed by ...g6 and ...Bg7, while allowing White to establish an impressive-looking centre with pawns on d4 and e4. It is named after the Slovenian Grandmaster Vasja Pirc.\n\n\n== General remarks ==\nThe Pirc Defence is a relatively new opening; while it was seen on occasion in the late nineteenth century, it was considered irregular, thus remaining a sideline. The opening began gaining some popularity only after World War II, and by the 1960s it was regarded as playable, owing in large part to the efforts of Canadian Grandmaster Duncan Suttles. Black, in hypermodern fashion, does not immediately stake a claim in the centre with pawns; rather, Black works to undermine White's centre from the flanks. Its first appearance in a World Championship match was in 1972, when it was played by Bobby Fischer against Boris Spassky at Reykjavík (game 17); the game ended in a draw.",
  "Caro-Kann Defense": "The Caro–Kann Defence is a chess opening characterised by the moves:\n1. e4 c6\nThe Caro–Kann is a common defence against the King's Pawn Opening and is classified as a \"Semi-Open Game\" like the Sicilian Defence and French Defence, although it is thought to be more solid and less dynamic than either of those openings. It often leads to good endgames for Black, who has the better pawn structure.\n\n\n== History ==\n\nThe opening is named after the English player Horatio Caro and the Austrian player Marcus Kann who analysed it in 1886. Kann scored an impressive 17-move victory with the Caro–Kann Defence against German-British chess champion Jacques Mieses at the 4th German Chess Congress in Hamburg in May 1885:\n1.e4 c6 2.d4 d5 3.e5 Bf5 4.Bd3 Bxd3 5.Qxd3 e6 6.f4 c5 7.c3 Nc6 8.Nf3 Qb6 9.0-0 Nh6 10.b3 cxd4 11.cxd4 Nf5 12.Bb2 Rc8 13.a3 Ncxd4 14.Nxd4 Bc5 15.Rd1 Nxd4 16.Bxd4 Bxd4+ 17.Qxd4 Rc1 0–1\n\n\n== Main line: 2.d4 d5 ==\nAfter 2.d4 d5 the most common moves are 3.Nc3 (Classical and Modern variations), 3.Nd2 (usually transposing into 3.Nc3), 3.exd5 (Exchange Variation), and 3.e5 (Advance Variation).\n\n\n=== 3.Nc3 and 3.Nd2 ===\n3.Nc3 and 3.Nd2 usually transpose into each other after 3...dxe4 4.Nxe4.",
  "Sicilian Defense": "The Sicilian Defence is a chess opening that begins with the following moves:\n1. e4 c5\nThe Sicilian is the most popular and best-scoring response to White's first move 1.e4. 1.d4 is a statistically more successful opening for White due to the high success rate of the Sicilian defence against 1.e4. New In Chess stated in its 2000 Yearbook that of the games in its database, White scored 56.1% in 296,200 games beginning 1.d4, but 54.1% in 349,855 games beginning 1.e4, mainly due to the Sicilian, which held White to a 52.3% score in 145,996 games.\n17% of all games between grandmasters, and 25% of the games in the Chess Informant database, begin with the Sicilian. Almost one quarter of all games use the Sicilian Defence.",
  "French Defense": "The French Defence is a chess opening characterised by the moves:\n1. e4 e6\nThis is most commonly followed by 2.d4 d5, with Black intending ...c5 at a later stage, attacking White's centre and gaining space on the queenside. White has extra space in the centre and on the kingside and often plays for a breakthrough with f4–f5. The French has a reputation for solidity and resilience, although some lines such as the Winawer Variation can lead to sharp complications. Black's position is often somewhat cramped in the early game; in particular, the pawn on e6 can impede the development of the bishop on c8.\n\n\n== Basics ==\n\nFollowing the opening moves 1.e4 e6, the game usually continues 2.d4 d5 (see below for alternatives).",
  "King's Pawn Game": "The King's Pawn Game is any chess opening starting with the move:\n1. e4\nIt is among the most popular opening moves in chess.\n\n\n== Details about the move and the game plan ==\nWhite opens with the most popular of the twenty possible opening moves. Although effective in winning for White (54.25%), it is not quite as successful as the four next most common openings for White: 1.d4 (55.95%), 1.Nf3 (55.8%), 1.c4 (56.3%), and 1.g3 (55.8%). Since nearly all openings beginning 1.e4 have names of their own, the term \"King's Pawn Game\", unlike Queen's Pawn Game, is rarely used to describe the opening of the game.\nAdvancing the king's pawn two squares is highly useful because it occupies a center square, attacks the center square d5, and allows the development of White's king's bishop and queen.",
  "Portuguese Opening": "The Portuguese Opening is a chess opening that begins with the moves:\n1. e4 e5\n2. Bb5\nThe Portuguese is an uncommon opening. In contrast to the Ruy Lopez (1.e4 e5 2.Nf3 Nc6 3.Bb5), by delaying Nf3, White leaves the f-pawn free to move and retains the possibility of playing f2–f4. The trade-off is that White's lack of pressure on e5 leaves Black with a freer hand.\n\n\n== Lines ==\nIf Black replies 2...Nf6, White can try a gambit with 3.d4.",
  "Center Game": "The Center Game is a chess opening that begins with the moves:\n1. e4 e5\n2. d4 exd4\nThe game usually continues 3.Qxd4 Nc6, developing with a gain of tempo for Black due to the attack on the white queen. (Note that 3.c3 is considered a separate opening: the Danish Gambit.)\n\nThe Center Game is an old opening. It was mostly abandoned by 1900 because no advantage could be demonstrated for White. Jacques Mieses, Savielly Tartakower and Rudolf Spielmann seemed to be the last strong players who would adopt it.",
  "Danish Gambit": "The Danish Gambit, known as the Nordisches Gambit (Nordic Gambit) in German, and the Noors Gambiet (Norwegian Gambit) in Dutch, is a chess opening that begins with the moves:\n1. e4 e5\n2. d4 exd4\n3. c3\nWhite will sacrifice one or two pawns for the sake of rapid development and the attack. However, with care, Black can accept one or both pawns safely, or simply decline the gambit altogether with good chances.\nAlthough it may have been known earlier, Danish player Martin Severin From essayed the gambit in the Paris 1867 tournament and he is usually given credit for the opening.",
  "Bishop's Opening": "The Bishop's Opening is a chess opening that begins with the moves:\n1. e4 e5\n2. Bc4\nWhite attacks Black's f7-square and prevents Black from advancing his d-pawn to d5. By ignoring the beginner's maxim \"develop knights before bishops\", White leaves his f-pawn unblocked, allowing the possibility of playing f2–f4.\nThe f2–f4 push gives the Bishop's Opening an affinity with the King's Gambit and the Vienna Game, two openings that share this characteristic. The Bishop's Opening can transpose into either of these openings, and in particular a favorable variation of the King's Gambit, but with care Black can circumvent this.",
  "Vienna Game": "The Vienna Game is an opening in chess that begins with the moves:\n1. e4 e5\n2. Nc3\nWhite's second move is less common than 2.Nf3, and is also more recent. A book reviewer wrote in the New York Times in 1888 that \"since Morphy only one new opening has been introduced, the 'Vienna'.\"\nThe original idea behind the Vienna Game was to play a delayed King's Gambit with f4, but in modern play White often plays more quietly (for example by fianchettoing his king's bishop with g3 and Bg2). Black most often continues with 2...Nf6. The opening can also lead to the Frankenstein–Dracula Variation.",
  "King's Gambit": "The King's Gambit is a chess opening that begins with the moves:\n1. e4 e5\n2. f4\nWhite offers a pawn to divert the black e-pawn. If Black accepts the gambit, White has two main plans. The first is to play d4 and Bxf4, regaining the gambit pawn with central domination. The alternative plan is to play Nf3 and Bc4 followed by 0-0, when the semi-open f-file allows White to barrel down onto the weakest point in Black's position, the pawn on f7.",
  "Elephant Gambit": "The Elephant Gambit (also called the Queen's Pawn Counter Gambit or Englund Counterattack) is a rarely played chess opening beginning with the moves:\n1. e4 e5\n2. Nf3 d5!?\nAlthough the Elephant Gambit is considered unsound, it has been used frequently by the Barbadian master Philip Corbin.\n\n\n== Lines ==\nWhite is able to capture either of Black's center pawns with the advantage, either by 3.exd5 or 3.Nxe5. With a center pawn removed, Black is in a passive position with White clearly having the initiative as White controls more space.",
  "Gunderam Defense": "The Gunderam Defense is a rarely played chess opening starting with the moves:\n1. e4 e5\n2. Nf3 Qe7\nIt is named after the chess player Gerhard Gunderam. The Gunderam Defense is categorized under the ECO code C40.\n\n\n== Overview ==\nAlthough 2...Qe7 does answer the threat against Black's e-pawn, it interferes with the development of Black's dark-square bishop. One of the ideas behind this awkward queen move is to unbalance the game by castling queenside while White will presumably castle kingside.",
  "King's Knight Opening": "The King's Knight Opening is a chess opening consisting of the moves:\n1. e4 e5\n2. Nf3\nThe opening is likely to continue into one of a number of other named openings, depending mainly on Black's second move.\n\n\n== Main line: 2...Nc6 ==\nMost games (more than 80%) continue with 2...Nc6.\nSome moves from here include:\n3. Bb5: Ruy Lopez\n3...a6: Ruy Lopez, Morphy Defence (main line)\n3...Nf6: Ruy Lopez, Berlin Defence\n3...d6: Ruy Lopez, Steinitz Defence\n3...f5: Ruy Lopez, Schliemann Defence\n3...Bc5: Ruy Lopez, Classical Defence\n\n3.",
  "Latvian Gambit": "The Latvian Gambit (or Greco Countergambit) is a chess opening characterised by the moves:\n1. e4 e5\n2. Nf3 f5?!\nIt is one of the oldest chess openings, having been analysed in the 17th century by Gioachino Greco, after whom it is sometimes named. The opening has the appearance of a King's Gambit with colours reversed. It is an aggressive but rather dubious choice for Black which often leads to wild and tricky positions.",
  "Philidor Defense": "The Philidor Defence is a chess opening characterised by the moves:\n1. e4 e5\n2. Nf3 d6\nThe opening is named after the famous 18th-century player François-André Danican Philidor, who advocated it as an alternative to the common 2...Nc6. His original idea was to challenge White's centre by the pawn thrust ...f7–f5.\nToday, the Philidor is known as a solid but passive choice for Black, and is seldom seen in top-level play except as an alternative to the heavily analysed openings that can ensue after the normal 2...Nc6. It is considered a good opening for amateur players who seek a defensive strategy that is simpler and easier to understand than the complex positions that result from an opening such as the French Defence.",
  "Petrov's Defense": "Petrov's Defence or the Petrov Defence (also called Petroff's Defence, Russian Defence, and Russian Game) is a chess opening characterised by the following moves:\n1. e4 e5\n2. Nf3 Nf6\nThough this symmetrical response has a long history, it was first popularised by Alexander Petrov, a Russian chess player of the mid-19th century. In recognition of the early investigations by the Russian masters Petrov and Carl Jaenisch, this opening is called the Russian Game in some countries.\nThe Petrov has a reputation of being dull and uninspired; however, it offers attacking opportunities for both sides, and a few lines are quite sharp. Often a trade occurs and Black, after gaining a tempo, has a well-placed knight.",
  "Irish Gambit": "The Irish Gambit, Chicago Gambit, or Razzle Dazzle Gambit, is a weak chess opening that begins:\n1. e4 e5\n2. Nf3 Nc6\n3. Nxe5?\nintending 3...Nxe5 4.d4 (see diagram).\n\n\n== Discussion ==\nWhite's pawns occupy the center, but the sacrifice of a knight for a pawn is a very high price to pay.",
  "Ponziani Opening": "The Ponziani Opening is a chess opening that begins with the moves:\n1. e4 e5\n2. Nf3 Nc6\n3. c3\nIt is one of the oldest chess openings, having been discussed in the literature by 1497. It was advocated by Howard Staunton, generally considered the world's strongest player from 1843 to 1851, in his 1847 book The Chess-Player's Handbook. For some decades, it was often called \"Staunton's Opening\" or the \"English Knight's Game\" as a result.",
  "Scotch Gambit": "The Scotch Game, or Scotch Opening, is a chess opening that begins with the moves:\n1. e4 e5\n2. Nf3 Nc6\n3. d4\nErcole del Rio, in his 1750 treatise Sopra il giuoco degli Scacchi, Osservazioni pratiche d’anonimo Autore Modenese (\"On the game of Chess, practical Observations by an anonymous Modenese Author\"), was the first author to mention what is now called the Scotch Game. The opening received its name from a correspondence match in 1824 between Edinburgh and London. Popular in the 19th century, by 1900 the Scotch had lost favour among top players because it was thought to release the central tension too early and allow Black to equalise without difficulty.",
  "Scotch Game": "The Scotch Game, or Scotch Opening, is a chess opening that begins with the moves:\n1. e4 e5\n2. Nf3 Nc6\n3. d4\nErcole del Rio, in his 1750 treatise Sopra il giuoco degli Scacchi, Osservazioni pratiche d’anonimo Autore Modenese (\"On the game of Chess, practical Observations by an anonymous Modenese Author\"), was the first author to mention what is now called the Scotch Game. The opening received its name from a correspondence match in 1824 between Edinburgh and London. Popular in the 19th century, by 1900 the Scotch had lost favour among top players because it was thought to release the central tension too early and allow Black to equalise without difficulty.",
  "Tayler Opening": "The Inverted Hungarian Opening or Tayler Opening is an uncommon chess opening that starts with the moves:\n1. e4 e5\n2. Nf3 Nc6\n3. Be2\nIt is so-named because the position of White's bishop on e2 resembles that of Black's bishop on e7 in the Hungarian Defense. \"This opening is also known as the Inverted Hanham and was played most prominently by Tartakower against Bogoljubow at London 1922.\"\n\n\n== Description ==\nThe Inverted Hungarian is even rarer than the already very uncommon Hungarian Defense, although it is perfectly playable for White. It may appeal to White players who wish to avoid extensively analyzed double king pawn openings such as the Ruy Lopez, and to those who favor defensive positional maneuvering battles as also often result from the Hungarian Defense.",
  "Four Knights Game": "The Four Knights Game is a chess opening that begins with the moves:\n1. e4 e5\n2. Nf3 Nc6\n3. Nc3 Nf6\nThis is the most common sequence, but the knights may develop in any order to reach the same position.\nThe opening is fairly popular with beginners who strictly adhere to the opening principle: \"Develop knights before bishops.\" It was one of the workhorses in the family of the Open Game, at even the highest levels, until World War I. Thereafter it fell by the wayside, along with a number of open games. In this period ambitious players explored the Ruy Lopez, believing it a better attempt for White to exploit the advantage of the first move.",
  "Three Knights Opening": "The Three Knights Game is a chess opening which most commonly begins with the moves:\n1. e4 e5\n2. Nf3 Nc6\n3. Nc3\nIn the Three Knights Game, Black chooses to break symmetry in order to avoid the main lines of what is often considered the drawish Four Knights Game after the usual 3...Nf6.\nThe relevant ECO code is C46.\n\n\n== Black's third move ==\nAfter tries such as 3...d6 or 3...Be7, White can play 4.d4, leaving Black with a cramped position resembling Philidor's Defense.",
  "Blackburne Shilling Gambit": "The Blackburne Shilling Gambit is the name facetiously given to a dubious chess opening, derived from an offshoot of the Italian Game, that begins:\n1. e4 e5\n2. Nf3 Nc6\n3. Bc4 Nd4?!\nIt is also sometimes referred to as the Kostić Gambit after the Serbian grandmaster Borislav Kostić, who played it in the early 20th century.\n\n\n== History ==\nWilhelm Steinitz made the first known mention of this line, noting it in 1895 in the Addenda to his Modern Chess Instructor, Part II. The earliest game with the opening on chessgames.com, Dunlop–Hicks, New Zealand Championship, dates from 1911.",
  "Giuoco Piano": "The Giuoco Piano (Italian: \"Quiet Game\"; pronounced [dʒwɔːko ˈpjaːno]), also called the Italian Opening, is a chess opening beginning with the moves:\n1. e4 e5\n2. Nf3 Nc6\n3. Bc4 Bc5\nCommon alternatives to 3...Bc5 include 3...Nf6 (the Two Knights Defence) and 3...Be7 (the Hungarian Defence). Much less common are 3...d6 (the Semi-Italian Opening), 3...g6, 3...Nd4 (the Blackburne Shilling Gambit), and 3...f5 (the Rousseau Gambit).\n\n\n== History ==\nThe Giuoco Piano is one of the oldest recorded openings.",
  "Italian Game": "The Italian Game is a family of chess openings beginning with the moves:\n1. e4 e5\n2. Nf3 Nc6\n3. Bc4\nThe Italian Game is part of the large family of Open Games or Double King's Pawn Games. It is one of the oldest recorded chess openings; it occurs in the Göttingen manuscript and was developed by players such as Damiano and Polerio in the 16th century, and later by Greco in 1620, who gave the game its main line. It has been extensively analysed for more than 300 years.",
  "Ruy Lopez": "The Ruy Lopez (; Spanish pronunciation: [ˈruj ˈlopeθ/ˈlopes]), also called the Spanish Opening or Spanish Game, is a chess opening characterised by the moves:\n1. e4 e5\n2. Nf3 Nc6\n3. Bb5\nThe Ruy Lopez is named after 16th-century Spanish bishop Ruy López de Segura. It is one of the most popular openings, with such a vast number of variations that in the Encyclopaedia of Chess Openings (ECO) all codes from C60 to C99 are assigned to them.\n\n\n== History ==\nThe opening is named after the 16th-century Spanish bishop Ruy López de Segura, who made a systematic study of this and other openings in the 150-page book on chess Libro del Ajedrez, written in 1561.",
  "Blackmar-Diemer Gambit": "The Blackmar–Diemer Gambit (or BDG) is a chess opening characterized by the moves:\n1. d4 d5\n2. e4 dxe4\n3. Nc3\nwhere White intends to follow up with f2–f3, usually on the fourth move. White obtains a move and a half-open f-file in return for a pawn, and as with most gambits, White aims to achieve rapid development and active posting of his pieces in order to rapidly build up an attack at the cost of the gambit pawn. It is one of the very few gambits available to White after 1.d4.",
  "Queen's Pawn Game": "The Queen's Pawn Game is any chess opening starting with the move:\n1. d4\nIt is the second most popular opening move after 1.e4. The name is usually used to describe openings beginning with 1.d4 where White does not play the Queen's Gambit. The most common Queen's Pawn Game openings are:\nThe London System, 2.Bf4 or 2.Nf3 and 3.Bf4\nThe Trompowsky Attack, 1...Nf6 2.Bg5 and the Pseudo-Trompowsky 1...d5 2.Bg5\nThe Torre Attack, 2.Nf3 and 3.Bg5\nThe Stonewall Attack, 2.e3\nThe Colle System, 2.Nf3 and 3.e3,\nThe Kingside Fianchetto, 2.Nf3 and 3.g3\nThe Barry Attack, 1...Nf6 2.Nf3 g6 3.Nc3 d5 4.Bf4\nThe Richter-Veresov Attack, 1...d5 2.Nc3 Nf6 3.Bg5 or 1...Nf6 2.Nc3 d5 3.Bg5\nThe Blackmar–Diemer Gambit, 1...d5 2.e4, and the Hübsch Gambit 1...Nf6 2.Nc3 d5 3.e4\nIn the Encyclopedia of Chess Openings (ECO), Closed Games (1.d4 d5) are classified under codes D00–D05. Openings where Black does not play 1...d5 are called Semi-Closed Games and classified as:\nIndian Defenses, where Black plays 1...Nf6 (ECO codes A45–A79, D70–D99, E00–E99); for instance the Queen's Indian Defense (ECO E12–E19);\nother Queen's Pawn Games, where Black plays neither 1...d5 nor 1...Nf6; these include the Dutch Defence (ECO A40–A44 and A80–A99).\n\n\n== History ==\nIn the 19th century and early 20th century, 1.e4 was by far the most common opening move by White (Watson 2006:87), while the different openings starting with 1.d4 were considered somewhat unusual and therefore classed together as \"Queen's Pawn Game\".",
  "Richter-Veresov Attack": "The Richter–Veresov Attack (or Veresov Opening) is a chess opening that begins with the moves:\n1. d4 d5\n2. Nc3 Nf6\n3. Bg5\nIt is also often reached by transposition, for example 1.d4 Nf6 2.Nc3 d5 3.Bg5 (the most common move order), 1.d4 Nf6 2.Bg5 d5 3.Nc3, or 1.Nc3 Nf6 2.d4 d5 3.Bg5.\nThe opening was named after the German International Master Kurt Richter and later the Soviet master Gavriil Veresov, who played it frequently for over a quarter of a century.\nAlong with the Trompowsky Attack, Colle System, London System, and Torre Attack, the Richter–Veresov Attack is one of the more common branches of the Queen's Pawn Game.",
  "Colle System": "The Colle System, also known as the Colle–Koltanowski system, is a chess opening strategy for White introduced by Belgian Edgard Colle in the 1920s, and further developed by George Koltanowski. This variation of the Queen's Pawn Game is characterised by a systematic if modest development of White's minor pieces to support a quick pawn move to the e4 square. It is solid, but inflexible.\nColle and Koltanowski each won many tournaments in the 1920s and 1930s. Colle finished ahead of Tartakower, Euwe and Rubinstein at various times. The opening had even been referred to as the “dreaded” Colle System.",
  "Queen's Gambit": "The Queen's Gambit is a chess opening that starts with the moves:\n1. d4 d5\n2. c4\nThe Queen's Gambit is one of the oldest known chess openings. It was mentioned in the Göttingen manuscript of 1490 and was later analysed by masters such as Gioachino Greco in the 17th century. In the 18th century, it was recommended by Phillip Stamma and is sometimes known as the Aleppo Gambit in his honour. During the early period of modern chess, queen pawn openings were not in fashion and the Queen's Gambit did not become common until the 1873 tournament in Vienna.",
  "Slav Defense": "The Slav Defense is a chess opening that begins with the moves:\n1. d4 d5\n2. c4 c6\nThe Slav is one of the primary defenses to the Queen's Gambit. Although it was analyzed as early as 1590, it was not until the 1920s that it started to be explored extensively. Many masters of Slavic descent helped develop the theory of this opening, including Alapin, Alekhine, Bogoljubov, and Vidmar.\nThe Slav received an exhaustive test during the two Alekhine–Euwe World Championship matches in 1935 and 1937.",
  "Tarrasch Defense": "The Tarrasch Defense is a chess opening characterized by the moves:\n1. d4 d5\n2. c4 e6\n3. Nc3 c5\nThe Tarrasch is a variation of the Queen's Gambit Declined.\nWith his third move, Black makes an aggressive bid for central space. After White plays cxd5 and dxc5, Black will be left with an isolated pawn on d5.",
  "Semi-Slav Defense": "The Semi-Slav Defense is a variation of the Queen's Gambit chess opening defined by the position reached after the moves:\n1. d4 d5\n2. c4 c6\n3. Nf3 Nf6\n4. Nc3 e6\nThe position may readily be reached by a number of different move orders. With Black advancing pawns to both e6 and c6, the opening resembles a mixture of the Orthodox Queen's Gambit Declined (QGD) and the Slav Defense.",
  "Amar Opening": "The Amar Opening (also known as Paris Opening, Drunken Knight Opening, or Ammonia Opening) is a chess opening defined by the move:\n1. Nh3\nThis opening is sometimes known as the Ammonia Opening, since NH3 is the chemical formula for ammonia. The Parisian amateur Charles Amar played it in the 1930s. It was probably named by Savielly Tartakower who used both names for this opening, although the chess author Tim Harding has jokingly suggested that \"Amar\" is an acronym for \"Absolutely mad and ridiculous\" (Winter 1996, p. 89).\nSince 1.Nh3 is considered an irregular opening, it is classified under the A00 code in the Encyclopaedia of Chess Openings.",
  "Catalan Opening": "The Catalan is a chess opening where White adopts a combination of the Queen's Gambit and Réti Opening: White plays d4 and c4 and fianchettoes the white bishop on g2. A common opening sequence is 1.d4 Nf6 2.c4 e6 3.g3, although the opening can arise from a large number of move orders (see transposition). ECO codes E01–E09 are for lines with 1.d4 Nf6 2.c4 e6 3.g3 d5 4.Bg2, and others are part of E00.\nBlack has two main approaches to choose between: in the Open Catalan he plays ...dxc4 and can either try to hold on to the pawn with ...b5 or give it back for extra time to free his game. In the Closed Catalan, Black does not capture on c4; his game can be somewhat cramped for a while, but is quite solid.\nThe Catalan is generally seen as a safe way for White to get a small advantage.",
  "Kangaroo Defense": "The Keres Defence (also known as the Kangaroo Defence or Franco-Indian Defense) is a chess opening characterised by the moves:\n1. d4 e6\n2. c4 Bb4+\nThe opening is named for Estonian grandmaster Paul Keres.\n\n\n== History ==\nThis opening was known since the 1840s and was played by Henry Thomas Buckle in his fourth match game with Johann Löwenthal, London 1851. The standard reply today, 3.Bd2, was recommended by Howard Staunton.\n\n\n== Discussion ==\nWhite can respond 3.Nc3, 3.Nd2, or 3.Bd2.",
  "Blumenfeld Countergambit": "The Lasker Trap is a chess opening trap in the Albin Countergambit, named after Emanuel Lasker, although it was first noted by Serafino Dubois (Hooper & Whyld 1996, p. 219). It is unusual in that it features an underpromotion as early as the seventh move.\n\n\n== Analysis ==\n1. d4 d5 2. c4 e5\nThe Albin Countergambit.\n3.",
  "Bogo-Indian Defense": "The Bogo-Indian Defence is a chess opening characterised by the moves:\n1. d4 Nf6\n2. c4 e6\n3. Nf3 Bb4+\nThe position arising after 1.d4 Nf6 2.c4 e6 is common. The traditional move for White here is 3.Nc3, threatening to set up a big pawn centre with 4.e4. However, 3.Nf3 is often played instead as a way of avoiding the Nimzo-Indian Defence (which would follow after 3.Nc3 Bb4).",
  "Nimzo-Indian Defense": "The Nimzo-Indian Defence is a chess opening characterised by the moves:\n1. d4 Nf6\n2. c4 e6\n3. Nc3 Bb4\nOther move orders, such as 1.c4 e6 2.Nc3 Nf6 3.d4 Bb4, are also feasible. In the Encyclopaedia of Chess Openings, the Nimzo-Indian is classified as E20–E59.\nThis hypermodern opening was developed by Aron Nimzowitsch who introduced it to master-level chess in the early 20th century.",
  "King's Indian Defense": "The King's Indian Defence is a common chess opening. It arises after the moves:\n1. d4 Nf6\n2. c4 g6\nBlack intends to follow up with 3...Bg7 and 4...d6 (the Grünfeld Defence arises when Black plays 3...d5 instead, and is considered a separate opening). White's major third move options are 3.Nc3, 3.Nf3 or 3.g3, with both the King's Indian and Grünfeld playable against these moves. The Encyclopaedia of Chess Openings classifies the King's Indian Defence under the codes E60 through E99."
}
